app/Controllers/SimpanPinjam.php

SELECT *
FROM `buku`
WHERE `judul` = 'Naruto Vol 60'
 LIMIT 1
---
    public function getBukuByJudul($judul)
    {
        $buku = $this->bukuModel->where('judul', $judul)->first();

SELECT *
FROM `anggota`
WHERE `nama` = 'Khalil Fansuri'
 LIMIT 1
---
    public function getAnggotaByNama($nama)
    {
        $anggota = $this->anggotaModel->where('nama', $nama)->first();

SELECT *
FROM `buku`
WHERE `isbn` = 'ISBN 978-602-8519-93-13'
 LIMIT 1
UPDATE `buku` SET `isbn` = 'ISBN 978-602-8519-93-13', `gambar` = 'komik3.jpg', `judul` = 'Kimetsu No Yaiba', `slug` = 'kimetsu-no-yaiba', `penulis` = 'Koyoharu Gotouge', `penerbit` = 'Shoenen Jump', `jenis` = 'Komik', `tahun` = '2021', `halaman` = '25', `jumlah` = 6, `lokasi` = 'Rak Nomor 5'
WHERE `buku`.`id` IN ('58')
INSERT INTO `simpanpinjam` (`isbn`, `judul`, `nomor`, `nama`, `kelas`, `tgl_pinjam`, `tgl_kembali`) VALUES ('ISBN 978-602-8519-93-13', 'Kimetsu No Yaiba', '14', 'Khalil Fansuri', '9F', '2023-08-09', '2023-08-16')
---
    public function save()
    {
        $isbn = $this->request->getVar('isbn');
        $buku = $this->bukuModel->where('isbn', $isbn)->first();
        $nomor = $this->request->getVar('nomor');
        $judul = $this->request->getVar('judul');
        $nama = $this->request->getVar('nama');
        $kelas = $this->request->getVar('kelas');
        $tgl_pinjam = $this->request->getPost('tgl_pinjam');
        $tgl_kembali = $this->request->getPost('tgl_kembali');
        if (!$buku) {
            return $this->response->setStatusCode(404)->setBody('Buku tidak ditemukan');
        }

        // Jika jumlah buku yang tersedia <= 0, tampilkan pesan error
        if ($buku['jumlah'] <= 0) {
            return $this->response->setStatusCode(400)->setBody('Buku sudah habis');
        }

        // Mengurangi jumlah buku yang tersedia
        $buku['jumlah']--;
        $this->bukuModel->save($buku);

        $this->simpanpinjamModel->save([
            'isbn' => $isbn,
            'judul' => $judul,
            'nomor' => $nomor,
            'nama' => $nama,
            'kelas' => $kelas,
            'tgl_pinjam' => $tgl_pinjam,
            'tgl_kembali' => $tgl_kembali
        ]);