app/Models/bukuModel.php

    public function getBuku($slug = false)
    {
        if ($slug == false) {
            return $this->findAll();
---
SELECT *
FROM `buku`