app/Models/databukuModel.php

SELECT *
FROM `buku`
---
    public function getBuku($slug = false)
    {
        if ($slug == false) {
            return $this->findAll();