app/Models/dataanggotaModel.php

SELECT *
FROM `anggota`
---
    public function getAnggota($slug = false)
    {
        if ($slug == false) {
            return $this->findAll();