app/Models/datasimpanpinjamModel.php

    public function getSimpanPinjam($id = false)
    {
        if ($id === false) {
            return $this->findAll();
---
SELECT *
FROM `simpanpinjam`