app/Models/simpanpinjamModel.php

SELECT *
FROM `simpanpinjam`
---
    public function getSimpanPinjam($id = false)
    {
        if ($id === false) {
            return $this->findAll();